chat_system_990175079_actor_description=Ameliy Midas. Titans' museum curator. Titans' expert.
chat_system_990175079_snap_3_question=^?^Excellent news! Now I can restore the museum! Though it will take much time.<br>Here is your reward.<br>[reward]<br><br>By the way, did you notice that the architecture of the Titans and elves has much in common? Oh, yes, but you've hardly been in Ellinia.
chat_system_990175079_snap_3_answer_0=^?^Thanks, I'll have an opportunity to look.
chat_system_990175079_snap_0_question=^?^Well, since you're going to visit the museum anyway, maybe you'll do me a favor?
chat_system_990175079_snap_0_answer_0=^?^What favor?
chat_system_990175079_snap_1_question=^?^You see, a troop of orcs under Bdyh Haar's command has taken over the museum.<br>The only hope is that the orcs still honor the Titans as their creators. I do so hope they won't smash the museum into bricks.<br>Could you please clear the museum of them?<br>[reward]
chat_system_990175079_snap_1_answer_0=^?^Yes, I'll help you - and maybe I'll find something interesting in there.
